In [1]:
# Importing libraries for data processing
import pandas as pd
import sqlite3

In [5]:
import os
os.getcwd()

'C:\\Users\\Kavitha\\OneDrive\\Desktop'

In [7]:
# Loading transactional order data
orders = pd.read_csv("orders.csv")
orders.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name
0,1,2508,450,18-02-2023,842.97,New Foods Chinese
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian

In [9]:
# Loading user master data
users = pd.read_json("users.json")
users.head()

   user_id    name       city membership
0        1  User_1    Chennai    Regular
1        2  User_2       Pune       Gold
2        3  User_3  Bangalore       Gold
3        4  User_4  Bangalore    Regular
4        5  User_5       Pune       Gold

In [11]:
# Create SQLite connection
conn = sqlite3.connect("restaurants.db")

# Execute SQL script
with open("restaurants.sql", "r") as file:
    sql_script = file.read()

conn.executescript(sql_script)

# Load restaurant table into DataFrame
restaurants = pd.read_sql("SELECT * FROM restaurants", conn)
restaurants.head()

   restaurant_id restaurant_name  cuisine  rating
0              1    Restaurant_1  Chinese     4.8
1              2    Restaurant_2   Indian     4.1
2              3    Restaurant_3  Mexican     4.3
3              4    Restaurant_4  Chinese     4.1
4              5    Restaurant_5  Chinese     4.8

In [13]:
merged_data = pd.merge(orders, users, on="user_id", how="left")
merged_data.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name,name,city,membership
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular

In [15]:
final_data = pd.merge(merged_data, restaurants, on="restaurant_id", how="left")
final_data.head()

,order_id,user_id,restaurant_id,order_date,total_amount,restaurant_name_x,name,city,membership,restaurant_name_y,cuisine,rating
0,1,2508,450,18-02-2023,842.97,New Foods Chinese,User_2508,Hyderabad,Regular,Restaurant_450,Mexican,3.2
1,2,2693,309,18-01-2023,546.68,Ruchi Curry House Multicuisine,User_2693,Pune,Regular,Restaurant_309,Indian,4.5
2,3,2084,107,15-07-2023,163.93,Spice Kitchen Punjabi,User_2084,Chennai,Gold,Restaurant_107,Mexican,4.0
3,4,319,224,04-10-2023,1155.97,Darbar Kitchen Non-Veg,User_319,Bangalore,Gold,Restaurant_224,Chinese,4.8
4,5,1064,293,25-12-2023,1321.91,Royal Eatery South Indian,User_1064,Pune,Regular,Restaurant_293,Italian,3.0

In [17]:
final_data.to_csv("final_food_delivery_dataset.csv", index=False)
print("Final dataset ready ✅")

Final dataset ready ✅

In [23]:
# Check all column names
final_data.columns

Index(['order_id', 'user_id', 'restaurant_id', 'order_date', 'total_amount',
       'restaurant_name_x', 'name', 'city', 'membership', 'restaurant_name_y',
       'cuisine', 'rating'],
      dtype='object')

In [25]:
gold_data = final_data[final_data['membership'] == 'Gold']

city_revenue_gold = gold_data.groupby('city')['total_amount'].sum().sort_values(ascending=False)
city_revenue_gold

city
Chennai      1080909.79
Pune         1003012.32
Bangalore     994702.59
Hyderabad     896740.19
Name: total_amount, dtype: float64

In [27]:
cuisine_avg = final_data.groupby('cuisine')['total_amount'].mean().sort_values(ascending=False)
cuisine_avg

cuisine
Mexican    808.021344
Italian    799.448578
Indian     798.466011
Chinese    798.389020
Name: total_amount, dtype: float64

In [31]:
user_total = final_data.groupby('user_id')['total_amount'].sum()
high_value_users = user_total[user_total > 1000].count()
high_value_users

2544

In [33]:
# Define bins
bins = [3.0, 3.5, 4.0, 4.5, 5.0]
labels = ['3.0–3.5', '3.6–4.0', '4.1–4.5', '4.6–5.0']

final_data['rating'] = pd.cut(final_data['rating'], bins=bins, labels=labels, include_lowest=True)
rating_revenue = final_data.groupby('rating')['total_amount'].sum().sort_values(ascending=False)
rating_revenue

rating
4.6–5.0    2197030.75
3.0–3.5    2136772.70
4.1–4.5    1960326.26
3.6–4.0    1717494.41
Name: total_amount, dtype: float64

In [35]:
gold_city_avg = gold_data.groupby('city')['total_amount'].mean().sort_values(ascending=False)
gold_city_avg

city
Chennai      808.459080
Hyderabad    806.421034
Bangalore    793.223756
Pune         781.162243
Name: total_amount, dtype: float64

In [37]:
cuisine_restaurants = final_data.groupby('cuisine')['restaurant_id'].nunique()
cuisine_revenue = final_data.groupby('cuisine')['total_amount'].sum()
cuisine_summary = pd.DataFrame({'num_restaurants': cuisine_restaurants, 'total_revenue': cuisine_revenue})
cuisine_summary

         num_restaurants  total_revenue
cuisine
Chinese              120     1930504.65
Indian               126     1971412.58
Italian              126     2024203.80
Mexican              128     2085503.09

In [39]:
total_orders = len(final_data)
gold_orders = len(gold_data)
percent_gold = round((gold_orders / total_orders) * 100)
percent_gold

50

In [43]:
restaurant_summary = final_data.groupby('restaurant_name_x').agg({'total_amount':['mean','count']})
restaurant_summary.columns = ['avg_amount','num_orders']
restaurant_filtered = restaurant_summary[restaurant_summary['num_orders'] < 20].sort_values('avg_amount', ascending=False)
restaurant_filtered

                                    avg_amount  num_orders
restaurant_name_x
Hotel Dhaba Multicuisine           1040.222308          13
Sri Mess Punjabi                   1029.180833          12
Ruchi Biryani Punjabi              1002.140625          16
Sri Delights Pure Veg               989.467222          18
Classic Kitchen Family Restaurant   973.167895          19
...                                        ...         ...
Annapurna Tiffins Punjabi           621.828947          19
Darbar Tiffins Non-Veg              596.815556          18
Darbar Restaurant Punjabi           589.972857          14
Spice Tiffins Pure Veg              578.578667          15
Ruchi Mess Punjabi                  572.686471          17

[170 rows x 2 columns]

In [49]:
combo_revenue = final_data.groupby(['membership','cuisine'])['total_amount'].sum().sort_values(ascending=False)
combo_revenue

membership  cuisine
Regular     Mexican    1072943.30
            Italian    1018424.75
Gold        Mexican    1012559.79
            Italian    1005779.05
Regular     Indian      992100.27
Gold        Indian      979312.31
            Chinese     977713.74
Regular     Chinese     952790.91
Name: total_amount, dtype: float64

In [53]:
final_data['order_date'] = pd.to_datetime(final_data['order_date'])

In [55]:
final_data['quarter'] = final_data['order_date'].dt.quarter
quarter_revenue = final_data.groupby('quarter')['total_amount'].sum().sort_values(ascending=False)
quarter_revenue

quarter
1    2041240.56
3    2009284.71
2    1986691.93
4    1974406.92
Name: total_amount, dtype: float64

In [59]:
gold_orders_count = final_data[final_data['membership'] == 'Gold'].shape[0]
gold_orders_count

4987

In [61]:
hyderabad_revenue = final_data[final_data['city'] == 'Hyderabad']['total_amount'].sum()
round(hyderabad_revenue)

1889367

In [63]:
distinct_users = final_data['user_id'].nunique()
distinct_users

2883

In [65]:
gold_avg_order_value = final_data[final_data['membership'] == 'Gold']['total_amount'].mean()
round(gold_avg_order_value, 2)

797.15

In [69]:
final_data['rating'] = pd.to_numeric(final_data['rating'], errors='coerce')

In [71]:
high_rating_orders = final_data[final_data['rating'] >= 4.5].shape[0]
high_rating_orders

0

In [77]:
gold_chennai_orders = final_data[
    (final_data['membership'] == 'Gold') &
    (final_data['city'] == 'Chennai')
].shape[0]

gold_chennai_orders

1337

In [79]:
final_data.shape[0]

10000